[{"word":"AngularJS","definition":"A front-end framework created by Misko Hevery and Adam Abrons at Google. Angular is what HTML would have been, had it been designed for applications. Often referred to just as Angular.","link":"https://angularjs.org/"},{"word":"array","definition":"An complex data type used for the ordered collection of objects.","link":"https://en.wikipedia.org/wiki/Array_data_structure"},{"word":"AJAX","definition":"Ajax (Asynchronous JavaScript and XML) is a set of web development techniques utilizing many web technologies used on the client-side to create asynchronous Web applications.","link":"https://en.wikipedia.org/wiki/Ajax_(programming)"},{"word":"Boolean","definition":"The Boolean data type is a data type, having two values (usually denoted true and false), intended to represent the truth values of logic and Boolean algebra. It is named after George Boole, who first defined an algebraic system of logic in the mid 19th century.","link":"https://en.wikipedia.org/wiki/Boolean"},{"word":"CSS","definition":"Cascading Style Sheets (CSS) is a style sheet language used for describing the presentation of a document written in a markup language.","link":"https://en.wikipedia.org/wiki/Cascading_Style_Sheets"},{"word":"CORS","definition":"Cross-origin resource sharing (CORS) is a mechanism that allows restricted resources (e.g. fonts) on a web page to be requested from another domain outside the domain from which the resource originated.","link":"https://en.wikipedia.org/wiki/Cross-origin_resource_sharing"},{"word":"dictionary","definition":"An associative container that maps (usually unique) keys to (not necessarily unique) values. A hash table (hash) is one possible implementation of such a dictionary.","link":"http://programmers.stackexchange.com/questions/30908/difference-between-hash-and-dictionary"},{"word":"EJS","definition":"EJS is a client-side templating language that was originally part of JavaScriptMVC. EJS combines data and a template to produce HTML.","link":"http://www.embeddedjs.com/"},{"word":"ERB","definition":"ERB (Embedded RuBy) is a feature of Ruby that enables you to conveniently generate any kind of text, in any quantity, from templates.","link":null},{"word":"Express","definition":"Express is a minimal and flexible Node.js web application framework that provides a robust set of features for web and mobile applications.","link":"http://expressjs.com/"},{"word":"Firebase","definition":"Firebase is a complete platform for building mobile and web applications. Firebase provides a realtime JSON database for storing and sync your app's data, tools to authenticate users with only client-side code, and production-grade static asset hosting. We take care of the complex server infrastructure so you can focus on creating an extraordinary experience for your users.","link":"https://www.firebase.com/"},{"word":"Grunt","definition":"Grunt is a JavaScript task runner used for the automation of repetitive tasks like minification, compilation, unit testing and linting.","link":"http://gruntjs.com/"},{"word":"Gulp","definition":"gulp.js - the streaming build system. Used for the automation of tasks.","link":"http://gulpjs.com/"},{"word":"HTML","definition":"HTML is a markup language for describing web documents (web pages). HTML stands for Hyper Text Markup Language. A markup language is a set of markup tags.","link":"https://en.wikipedia.org/wiki/HTML"},{"word":"I","definition":null,"link":null},{"word":"JavaScript","definition":"Javascript is a high-level, dynamic, untyped, and interpreted programming language. It was created by Brendan Eich in 10 days when he was allegedly drunk.","link":"https://en.wikipedia.org/wiki/JavaScript"},{"word":"Jasmine","definition":"Jasmine is an open source testing framework for JavaScript.","link":"http://jasmine.github.io/"},{"word":"Karma","definition":"A test runner for Javascript built by the Angular team.","link":"https://karma-runner.github.io"},{"word":"L","definition":null,"link":null},{"word":"Mocha","definition":"Mocha is a feature-rich JavaScript test framework running on Node.js and the browser, making asynchronous testing simple and fun.","link":"https://mochajs.org/"},{"word":"Node.js","definition":"Node.js is a JavaScript runtime built on Chrome's V8 JavaScript engine. Node has allowed Javascript to be run server-side.","link":"https://nodejs.org/"},{"word":"O","definition":null,"link":null},{"word":"P","definition":null,"link":null},{"word":"Q","definition":null,"link":null},{"word":"Rails","definition":"A short name for Ruby on Rails.","link":"http://rubyonrails.org/"},{"word":"Ruby on Rails","definition":"Ruby on Rails, or simply Rails, is a web application framework written in Ruby under MIT License. Rails is a model–view–controller (MVC) framework, providing default structures for a database, a web service, and web pages.","link":"http://rubyonrails.org/"},{"word":"Ruby","definition":"A dynamic, open source programming language with a focus on simplicity and productivity. It has an elegant syntax that is natural to read and easy to write.","link":"https://www.ruby-lang.org"},{"word":"ruby","definition":"ruby with a lowercase r is the name of the ruby interpreter.","link":"https://www.ruby-lang.org"},{"word":"SCSS","definition":"A newer syntax of SASS that doesn't rely on indentation.","link":"http://sass-lang.com/"},{"word":"SASS","definition":"Sass (Syntactically Awesome Style Sheets) is a scripting language that is interpreted into Cascading Style Sheets (CSS).","link":"http://sass-lang.com/"},{"word":"T","definition":null,"link":null},{"word":"U","definition":null,"link":null},{"word":"V","definition":null,"link":null},{"word":"W","definition":null,"link":null},{"word":"X","definition":null,"link":null},{"word":"Y","definition":null,"link":null},{"word":"Zend Framework (ZF)","definition":"is an open source, object-oriented web application framework implemented in PHP.","link":"http://framework.zend.com/"}]